[
"TrackMania fact #1 TM community supports trans rights as much as Amaterasu's chat supports his desire of PB'ing World of Wampus TransgenderPride",
"TrackMania fact #13 every track is a kacky track if you TAS hard enough",
"TrackMania fact #69 despite multiple petitions voting against it, RaeTM still builds and publishes new maps that make the average player mald.",
"TrackMania fact #117 the water for the TrackMania summer update was gained from melting glaciers. Because of this Nadeo is under heavy criticism by climate activists",
"TrackMania fact #231 the plastic used in the new update is 100% recycled",
"TrackMania fact #390 speedslides happen because at >390 speed the tires reach temperatures that turn the material into a supersolid which unifies the properties of superfluids and rigid bodies. That means with the right angle you get normal grip while simultaneuosly having close to zero rolling resistance. The recipe for the tyre material is Nadeo's most valuable asset.",
"TrackMania fact #461 fuck u ama",
"TrackMania fact #517 the yellow border markings on ice platform blocks are in fact not colored with paint monkaStare",
"TrackMania fact #923 engine off doesn't actually turn your engine off, it just places a brick under the throttle",
"TrackMania fact #924 in TM2020 the engine off brick wasnt secured properly so every time you crash into a wall it shifts around and gets under the gas pedal for a second.",
"TrackMania fact #1843 if you color ice red it will taste like strawberries",
"TrackMania fact #1421 the yellow boosters on ice are not made out of what you think",
"TrackMania fact #2321 the sausage blocks are in fact vegan",
"TrackMania fact #2361 due to the coriolis effect, speed slides to the right are faster for players on the northern hemisphere and slower for players on the southern hemisphere",
"TrackMania fact #2804 you can have world records only for a short period but Tauro Forever",
"TrackMania fact #5019 The stunt score was scrapped during the development of TM 2020 because the values generated by Kacky tracks in TM2 made the score completely irrelevant.",
"TrackMania fact #6542 if you spell TrackMania Grand League backwards it's eugaeL dnarG ainamkcarT which makes no sense like the org based slot system",
"TrackMania fact #6612 TM players from outside the European Union have to show their visa when passing a checkpoint",
"TrackMania fact #7210 the recommended yearly consumption of salt is about 2.19 kilograms. This is also the average amount of salt in the Twitter comments of the TOTD announcement posts.",
"TrackMania fact #8072 using the French car unlocks the ability to shift into higher gears when driving backwards",
"TrackMania fact #8091 driving a Press Forward map with keyboard is a W",
"TrackMania fact #9827 the term for teaching players how to drift is \"tech support\"",
"TrackMania fact #9113 the cars of trackmania streamers are usually faster because of the constant oiling they receive",
"TrackMania fact #14521 the chance of Kem_ being a mod in a given TM stream is low - but never zero",
"TrackMania fact #20021 Nadeo is an acronym for Not All Decisions Explained Officially",
"TrackMania fact #20387 Nadeo uses about 70% of their turnover to finance gardeners trimming and watering the trees, bushes and grass patches",
"TrackMania fact #23102 using white colored flags on a track forces French players to instantly give up",
"TrackMania fact #23182 htimh leaked the mechanic of wet tires with the track MIXTA VIA",
"TrackMania fact #23183 the tires of TrackMania cars have to be changed after every run, the 3-2-1 countdown leaves time for the crew to change the tires without losing more than 2 of the members to the exhaust heat",
"TrackMania fact #23184 let me start my old gas driven stadium car real quick",
"TrackMania fact #23872 CarlJr drives a modified version of the TM car that is able to shift in to gear 5.5",
"TrackMania fact #23971 acceleration penalty occurs because after a crash particles of the car's paint get lost thus the board computer is busy recalculating the car's weight so it can't do other things like FUCKING MOVING THE CAR, YOU PIECE OF SHIT START ACCELERATING I SWEAR TO GOD",
"TrackMania fact #23987 every block has to be manufactured in every color in advance which is the reason why it took Nadeo a year to ship colored blocks",
"TrackMania fact #29831 the first recorded reactor zoop happened in April 26 1986 on reactor block #4 in Prypjat",
"TrackMania fact #34213 The fastest time to finish any track can be calculated with the formula T = vmax times L รท N where vmax is the car's top speed, L is the track's length and N is the amount of noseboosts TAS makers can squeeze in",
"TrackMania fact #34722 the game Rocket League was inspired by an incident where Kacky players were given a ball",
"TrackMania fact #34862 one day, someone woke up and thought: hm, LOL does not seem LOL enough anymore. And thus Kacky was born.",
"TrackMania fact #72549 On a fateful day, one trackmania player escaped from the matrix and discovered the truth that all is just a simulation. On this day the chosen one transcended the rules of drifting and so the neodrift was born.",
"TrackMania fact #77214 German drivers are legally allowed to exceed the game's speed limit of 999 on FullSpeed tracks",
"TrackMania fact #86112 there's a confidential Wirtual video manuscript about the widespread alcoholism in former kacky players that suffer under PTSD with the title \"and then they got this Rum\"",
"TrackMania fact #98727 legends say Mudda found a secret technique discovered by the Aboriginal Australians which allowed them to speedslide at any speed"
]
